app/Controllers/Dashboard.php

    public function index() {
        $productModel = new Products_model();
        $data['products'] = $productModel->findAll();
---
SELECT *
FROM `products`

    public function editproduct($id) {
        $productModel = new Products_model();
        $data['product'] = $productModel->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`product_id` = '11'